docs/comp-sci/theorem-provers/mizar.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-12-31 Sat 09:10 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mizar</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Mizar</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-6bd8d47a-d34f-4cfa-b541-e1cf3bcac9f7">1. Useful Definitions</a></li>
<li><a href="#h-19c0ab35-60e3-4d69-9ec4-9eb1bf8cef89">2. Random</a></li>
<li><a href="#h-afdc709c-b5e8-4cb9-9cee-81984c7a3c09">3. Lessons Learned</a>
<ul>
<li><a href="#h-c0226382-31df-4572-891b-e9ae20a09b98">3.1. Vocabulary Files</a></li>
</ul>
</li>
<li><a href="#h-db11b193-c42a-415b-b960-c4efc7dacd50">4. Installing on Raspberry Pi</a></li>
<li><a href="#h-d045530e-55fb-44e0-af41-03ffc4e5720a">5. Exporting MIZFILES on Linux</a></li>
<li><a href="#h-5b2a23b4-8625-4b20-a0b0-a13c66678638">6. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-6bd8d47a-d34f-4cfa-b541-e1cf3bcac9f7" class="outline-2">
<h2 id="h-6bd8d47a-d34f-4cfa-b541-e1cf3bcac9f7"><span class="section-number-2">1.</span> Useful Definitions</h2>
<div class="outline-text-2" id="text-h-6bd8d47a-d34f-4cfa-b541-e1cf3bcac9f7">
<ul class="org-ul">
<li><code>Element of X</code> is defined in <a href="http://www.mizar.org/version/current/html/subset_1.html"><code>subset_1.miz</code></a> , lines 67 <i>et seq</i>.</li>
<li><code>Subset of X</code> is defined in <a href="http://www.mizar.org/version/current/html/subset_1.html"><code>subset_1.miz</code></a> (line 99), but it just means
<code>Element of bool X</code>; and <code>bool X</code> is defined in <a href="http://www.mizar.org/version/current/html/zfmisc_1.html"><code>zfmisc_1.miz</code></a>
(line 71) as <code>bool X -&gt; set means Z in it iff Z c= X</code> (and <code>c=</code> is the
subset operator, defined in <a href="http://mizar.org/version/current/html/tarski.html"><code>tarski.miz</code></a>, as we would expect its
meaning \(X\subseteq Y\iff (\forall x, x\in X\implies x\in Y)\))</li>
</ul>
</div>
</div>

<div id="outline-container-h-19c0ab35-60e3-4d69-9ec4-9eb1bf8cef89" class="outline-2">
<h2 id="h-19c0ab35-60e3-4d69-9ec4-9eb1bf8cef89"><span class="section-number-2">2.</span> Random</h2>
<div class="outline-text-2" id="text-h-19c0ab35-60e3-4d69-9ec4-9eb1bf8cef89">
<ul class="org-ul">
<li>Cayley-Dickson construction in <a href="http://mizar.org/version/current/html/cayldick.html"><code>cayldick.miz</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-h-afdc709c-b5e8-4cb9-9cee-81984c7a3c09" class="outline-2">
<h2 id="h-afdc709c-b5e8-4cb9-9cee-81984c7a3c09"><span class="section-number-2">3.</span> Lessons Learned</h2>
<div class="outline-text-2" id="text-h-afdc709c-b5e8-4cb9-9cee-81984c7a3c09">
</div>

<div id="outline-container-h-c0226382-31df-4572-891b-e9ae20a09b98" class="outline-3">
<h3 id="h-c0226382-31df-4572-891b-e9ae20a09b98"><span class="section-number-3">3.1.</span> Vocabulary Files</h3>
<div class="outline-text-3" id="text-h-c0226382-31df-4572-891b-e9ae20a09b98">
<p>
When defining new terms, well, we should get started by doing something
like:
</p>

<pre class="example" id="orgdde2479">
user@computer:~/$ mkdir -p work/first-article/
user@computer:~/$ cd work/first-article/
user@computer:~/work/first-article/$ mkdir DICT
user@computer:~/work/first-article/$ mkdir TEXT
user@computer:~/work/first-article/$ mkdir PREL
</pre>

<p>
Now for a "Hello World" type Mizar file: just create a new predicate
<code>foobar</code>. We do this by creating <code>first-article/DICT/TMP.voc</code> and
sticking one line in it:
</p>

<pre class="example" id="org74943e5">
Rfoobar
</pre>

<p>
Then in <code>first-article/TEXT/TMP.miz</code> we would have:
</p>

<pre class="example" id="org788f310">
environ
vocabularies TMP; :: this is important! Without it, you get an error


begin

definition
  let a,b be set;
  pred a,b foobar means
  :Def1:
  a = b;
end;
</pre>

<p>
Without the <code>vocabularies TMP;</code> line, you'll get a "301: Predicate
symbol expected" error, basically Mizar telling you that you forgot to
include <code>foobar</code> as a predicate in your vocabulary file.
</p>
</div>
</div>
</div>

<div id="outline-container-h-db11b193-c42a-415b-b960-c4efc7dacd50" class="outline-2">
<h2 id="h-db11b193-c42a-415b-b960-c4efc7dacd50"><span class="section-number-2">4.</span> Installing on Raspberry Pi</h2>
<div class="outline-text-2" id="text-h-db11b193-c42a-415b-b960-c4efc7dacd50">
<p>
This was surprisingly simple. I usually keep source code related stuff
in <code>~/src/</code>, so here's the bash commands that got me cooking:
</p>

<pre class="example" id="orgc9b4998">
alex@pi:~$ cd src
alex@pi:~/src/$ mkdir mizar
alex@pi:~/src/$ cd mizar
alex@pi:~/src/mizar/$ wget http://mizar.uwb.edu.pl/~softadm/pub/system/arm-linux/mizar-8.1.09_5.59.1363-arm-linux.tar
alex@pi:~/src/mizar/$ tar -xvf mizar-8.1.09_5.59.1363-arm-linux.tar
README
install.sh
mizbin.tar.gz
mizdoc.tar.gz
mizshare.tar.gz

alex@pi:~/src/mizar$ ls

install.sh                            mizbin.tar.gz  mizshare.tar.gz
mizar-8.1.09_5.59.1363-arm-linux.tar  mizdoc.tar.gz  README

alex@pi:~/src/mizar$ sudo ./install.sh --default
...
</pre>

<p>
Then I added one line of code to my <code>~/.bash_profile</code>:
</p>

<pre class="example" id="org641ba57">
# at the end of ~/.bash_profile
MIZFILES=/usr/local/share/mizar
</pre>

<p>
And, <i>voilà/, once we've =source ~</i>.bash<sub>profile</sub>= we'll be able to start
proving in no time. Unfortunately, I still have problems trying to get
it working on my Raspberry Pi.
</p>
</div>
</div>

<div id="outline-container-h-d045530e-55fb-44e0-af41-03ffc4e5720a" class="outline-2">
<h2 id="h-d045530e-55fb-44e0-af41-03ffc4e5720a"><span class="section-number-2">5.</span> Exporting MIZFILES on Linux</h2>
<div class="outline-text-2" id="text-h-d045530e-55fb-44e0-af41-03ffc4e5720a">
<p>
On Ubuntu, I noticed it was insufficient to add <code>MIZFILES=/usr/local/share/mizar</code>
followed by <code>export MIZFILES</code>
to my <code>.bashrc</code>; instead I needed to add a line to <code>/etc/environment</code>, namely:
</p>

<pre class="example" id="orgd84cc90">
# in /etc/environment, at the end
MIZFILES=/usr/local/share/mizar
</pre>

<p>
After rebooting the computer, emacs expands <code>(substitute-in-file-name "$MIZFILES")</code>
correctly to <code>/usr/local/share/mizar</code>. This allows me to compile a Mizar
file in Emacs with <code>C-c Ret</code>.
</p>
</div>
</div>

<div id="outline-container-h-5b2a23b4-8625-4b20-a0b0-a13c66678638" class="outline-2">
<h2 id="h-5b2a23b4-8625-4b20-a0b0-a13c66678638"><span class="section-number-2">6.</span> References</h2>
<div class="outline-text-2" id="text-h-5b2a23b4-8625-4b20-a0b0-a13c66678638">
<ul class="org-ul">
<li>Freek Wiedijk's <a href="http://mizar.org/project/mizman.pdf">Write a Mizar Article in 9 Easy Steps</a></li>
<li>Adam Grabowski, Artur Kornilowicz, and Adam Naumowicz,<br>
<a href="https://jfr.unibo.it/article/view/1980/1356">Mizar in a Nutshell</a>.</li>
<li><a href="https://math.stackexchange.com/a/2806593/31693">Getting to Know the Mizar Math Library</a>, math stackexchange thread,
worth reading</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2022-12-31 Sat 08:23.</p>
</div>
</body>
</html>